Revit 2027 API
ExporterIFCUtils.GetWallTrimmedCurve Method
 Obtains the curve of the wall trimmed or extended according to the end conditions of the wall.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Curve GetWallTrimmedCurve(
	Wall pVWall
)
Public Shared Function GetWallTrimmedCurve (
	pVWall As Wall
) As Curve
public:
static Curve^ GetWallTrimmedCurve(
	Wall^ pVWall
)
static member GetWallTrimmedCurve :
        pVWall : Wall -> Curve
Parameters
pVWall Wall
 The wall.
Return Value
Curve
 The trimmed or extended curve.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace